РП/src/Catalogs/РесурсныеСпецификации/РесурсныеСпецификации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>РесурсныеСпецификации</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>Статус</name>
    <type>
      <types>EnumRef.СтатусыСпецификаций</types>
    </type>
  </attributes>
  <attributes>
    <name>НачалоДействия</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КонецДействия</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>МногоэтапныйПроизводственныйПроцесс</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Описание</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ОптимальноеКоличествоПередачиМеждуЭтапами</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПечатьМаршрутнойКарты</name>
    <type>
      <types>EnumRef.ВариантыПечатиМаршрутнойКартыНаПродукцию</types>
    </type>
  </attributes>
  <attributes>
    <name>УДАЛИТЬСЕЙЧАССтатьяКалькуляцииПФР</name>
    <type>
      <types>CatalogRef.СтатьиКалькуляции</types>
    </type>
  </attributes>
  <attributes>
    <name>УДАЛИТЬСЕЙЧАССтатьяКалькуляцииФСС</name>
    <type>
      <types>CatalogRef.СтатьиКалькуляции</types>
    </type>
  </attributes>
  <attributes>
    <name>УДАЛИТЬСЕЙЧАССтатьяКалькуляцииФОМС</name>
    <type>
      <types>CatalogRef.СтатьиКалькуляции</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатьяКалькуляцииВзносов</name>
    <type>
      <types>CatalogRef.СтатьиКалькуляции</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ВыходныеИзделия</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Упаковка</name>
      <type>
        <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоУпаковок</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Этап</name>
      <type>
        <types>CatalogRef.ЭтапыПроизводства</types>
      </type>
    </attributes>
    <attributes>
      <name>ЭтапРедактирование</name>
      <type>
        <types>CatalogRef.ЭтапыПроизводства</types>
      </type>
    </attributes>
    <attributes>
      <name>ДоляСтоимости</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ТребуетсяУказыватьСерии</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ВозвратныеОтходы</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Упаковка</name>
      <type>
        <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоУпаковок</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Этап</name>
      <type>
        <types>CatalogRef.ЭтапыПроизводства</types>
      </type>
    </attributes>
    <attributes>
      <name>ЭтапРедактирование</name>
      <type>
        <types>CatalogRef.ЭтапыПроизводства</types>
      </type>
    </attributes>
    <attributes>
      <name>СтатьяКалькуляции</name>
      <type>
        <types>CatalogRef.СтатьиКалькуляции</types>
      </type>
    </attributes>
    <attributes>
      <name>ОписаниеИзделия</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>МатериалыИУслуги</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Упаковка</name>
      <type>
        <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоУпаковок</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Этап</name>
      <type>
        <types>CatalogRef.ЭтапыПроизводства</types>
      </type>
    </attributes>
    <attributes>
      <name>ЭтапРедактирование</name>
      <type>
        <types>CatalogRef.ЭтапыПроизводства</types>
      </type>
    </attributes>
    <attributes>
      <name>СтатьяКалькуляции</name>
      <type>
        <types>CatalogRef.СтатьиКалькуляции</types>
      </type>
    </attributes>
    <attributes>
      <name>СпособАвтовыбораНоменклатуры</name>
      <type>
        <types>EnumRef.СпособыАвтовыбораНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>СпособАвтовыбораХарактеристики</name>
      <type>
        <types>EnumRef.СпособыАвтовыбораХарактеристики</types>
      </type>
    </attributes>
    <attributes>
      <name>СвойствоСодержащееНоменклатуру</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ОтборСвойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ОтборЗначениеСвойства</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>АлгоритмРасчетаКоличества</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ПрименениеМатериала</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КлючСвязи</name>
      <type>
        <types>UUID</types>
      </type>
    </attributes>
    <attributes>
      <name>ПроизводитсяВПроцессе</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ТребуетсяУказыватьСерии</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ИсточникПолученияПолуфабриката</name>
      <type>
        <types>CatalogRef.РесурсныеСпецификации</types>
        <types>CatalogRef.ЭтапыПроизводства</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Трудозатраты</name>
    <attributes>
      <name>ВидРабот</name>
      <type>
        <types>CatalogRef.ВидыРаботСотрудников</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СтатьяКалькуляции</name>
      <type>
        <types>CatalogRef.СтатьиКалькуляции</types>
      </type>
    </attributes>
    <attributes>
      <name>Этап</name>
      <type>
        <types>CatalogRef.ЭтапыПроизводства</types>
      </type>
    </attributes>
    <attributes>
      <name>ЭтапРедактирование</name>
      <type>
        <types>CatalogRef.ЭтапыПроизводства</types>
      </type>
    </attributes>
    <attributes>
      <name>НазначениеРабот</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>СоответствиеСвойств</name>
    <attributes>
      <name>СвойствоМатериала</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>СвойствоПродукции</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>КлючСвязиМатериал</name>
      <type>
        <types>UUID</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

РП/src/Enums/СтатусыСпецификаций/СтатусыСпецификаций.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СтатусыСпецификаций</name>
  <enumValues>
    <name>ВРазработке</name>
  </enumValues>
  <enumValues>
    <name>Действует</name>
  </enumValues>
  <enumValues>
    <name>Закрыта</name>
  </enumValues>
</mdclass:Enum>

РП/src/Catalogs/ХарактеристикиНоменклатуры/ХарактеристикиНоменклатуры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ХарактеристикиНоменклатуры</name>
  <owners>Catalog.ВидыНоменклатуры</owners>
  <owners>Catalog.Номенклатура</owners>
  <attributes>
    <name>НаименованиеПолное</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1024</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Принципал</name>
    <type>
      <types>CatalogRef.Организации</types>
      <types>CatalogRef.Партнеры</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Организации</types>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

РП/src/Catalogs/РесурсныеСпецификации/Forms/ВыборДействующихСпецификаций/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	УстановитьУсловноеОформление();
	
	Если Параметры.Свойство("АвтоТест") Тогда // Возврат при получении формы для анализа.
		Возврат;
	КонецЕсли;
	
	Параметры.Свойство("ИсключитьИзВыбораСпецификацию", ИсключитьИзВыбораСпецификацию);
	Параметры.Свойство("ПоказыватьСпецификацииПоФиксированнойСтоимости", ПоказыватьСпецификацииПоФиксированнойСтоимости);
	Параметры.Свойство("СпецификацииГдеИзделиеЯвляетсяОсновным",         СпецификацииГдеИзделиеЯвляетсяОсновным);
	
	Если НЕ Параметры.Свойство("ИсключитьСпецификацииСЭтапамиПроизводстваНаСтороне", ИсключитьСпецификацииСЭтапамиПроизводстваНаСтороне) Тогда
		
		ИсключитьСпецификацииСЭтапамиПроизводстваНаСтороне = Параметры.Свойство("УстановитьФильтрПоЗаказу")
																И Параметры.Свойство("ПроизводствоПоЗаказу")
																И Параметры.ПроизводствоПоЗаказу = Истина
																И Параметры.Свойство("Заказ")
																//++ НЕ УТКА
																И ТипЗнч(Параметры.Заказ) = Тип("ДокументСсылка.ЗаказДавальца")
																//-- НЕ УТКА
																;
		
	КонецЕсли;
	
	Если НЕ Параметры.Свойство("Заголовок", Заголовок) Тогда
		Заголовок = НСтр("ru='Ресурсные спецификации';uk='Ресурсні специфікації'");
	КонецЕсли;
	
	Если Параметры.Свойство("Номенклатура") Тогда
		Номенклатура = Параметры.Номенклатура;
		Параметры.Свойство("Характеристика",     Характеристика);
		Параметры.Свойство("Подразделение",      Подразделение);
		Параметры.Свойство("НачалоПроизводства", НачалоПроизводства);
		Параметры.Свойство("ВсеСпецификации",    ВсеСпецификации);
		
		СписокСпецификацийДляЗаданнойНоменклатуры();
		
	ИначеЕсли Параметры.Свойство("СписокИзделий") Тогда
		
		СписокСпецификацийИзделий(Параметры.СписокИзделий);
		
	ИначеЕсли Параметры.Свойство("АдресТаблицыПродукции") Тогда
		
		НастроитьФормуПоТаблицеПродукции();
		
	Иначе
		ВызватьИсключение НСтр("ru='Для открытия формы необходимо передать параметры.';uk='Для відкриття форми необхідно передати параметри.'");
	КонецЕсли; 
	
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(
		Список,
		"НачалоПроизводства",
		НачалоПроизводства);
		
	Если НЕ ВсеСпецификации Тогда
		// Отоборажаются только действующие
		Элементы.Статус.Видимость = Ложь;
	КонецЕсли; 

	СобытияФорм.ПриСозданииНаСервере(ЭтаФорма, Отказ, СтандартнаяОбработка);

КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "Запись_ОсновныеСпецификации" Тогда
		УстановитьСпецификацияПоУмолчанию();
	КонецЕсли; 
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ВыбратьИНазначитьОсновной(Команда)
	
	ТекущиеДанные = Элементы.Список.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если НазначитьОсновнойТекущуюСпецификацию() Тогда
		ОповеститьОВыборе(ТекущиеДанные.Ссылка);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура НазначитьОсновной(Команда)
	
	НазначитьОсновнойТекущуюСпецификацию();	
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ВыполнитьПереопределяемуюКоманду(Команда)
	
	СобытияФормКлиент.ВыполнитьПереопределяемуюКоманду(ЭтаФорма, Команда);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область Прочее

&НаСервере
Процедура УстановитьУсловноеОформление()

	УсловноеОформление.Элементы.Очистить();
	
	УправлениеДаннымиОбИзделиях.УстановитьУсловноеОформлениеСпискаСпецификаций(Список.УсловноеОформление);

КонецПроцедуры

&НаКлиенте
Функция НазначитьОсновнойТекущуюСпецификацию()

	ТекущиеДанные = Элементы.Список.ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено Тогда
		
		Возврат Ложь;
		
	КонецЕсли;
	
	Если ТаблицаПродукции.Количество() > 0 Тогда
		
		Результат = Истина;
		
		Для Каждого Строка Из ТаблицаПродукции Цикл
			
			Результат = Результат И УправлениеДаннымиОбИзделияхКлиент.НазначитьОсновнойСпецификацией(
							Строка.Подразделение,
							Строка.Номенклатура,
							Строка.Характеристика,
							ТекущиеДанные.Ссылка);
			
		КонецЦикла;
		
	Иначе
		
		Результат = УправлениеДаннымиОбИзделияхКлиент.НазначитьОсновнойСпецификацией(
							Подразделение, 
							Номенклатура, 
							Характеристика, 
							ТекущиеДанные.Ссылка);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Процедура УстановитьСпецификацияПоУмолчанию()
	
	Если ТаблицаПродукции.Количество() > 0 Тогда
		
		СпецификацияПоУмолчанию = ОсновнаяСпецификацияПоТаблицеПродукции();
		
	Иначе
		
		СпецификацияПоУмолчанию = УправлениеДаннымиОбИзделияхВызовСервера.ПолучитьОсновнуюСпецификацию(
									Подразделение, 
									Номенклатура, 
									Характеристика, 
									НачалоПроизводства);
									
									
	КонецЕсли;
	
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(Список, "СпецификацияПоУмолчанию", СпецификацияПоУмолчанию);
		
КонецПроцедуры

&НаСервере
Процедура СписокСпецификацийДляЗаданнойНоменклатуры()

	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	Т.Ссылка
	|ИЗ
	|	(ВЫБРАТЬ РАЗЛИЧНЫЕ
	|		ВыходныеИзделияСпецификации.Ссылка КАК Ссылка
	|	ИЗ
	|		Справочник.РесурсныеСпецификации.ВыходныеИзделия КАК ВыходныеИзделияСпецификации
	|	ГДЕ
	|		НЕ ВыходныеИзделияСпецификации.Ссылка.ПометкаУдаления
	|		И (ВыходныеИзделияСпецификации.Ссылка.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыСпецификаций.Действует)
	|				ИЛИ &ВсеСпецификации)
	|		И ВыходныеИзделияСпецификации.Номенклатура = &Номенклатура
	|		И (ВыходныеИзделияСпецификации.Характеристика = &Характеристика
	|				ИЛИ ВыходныеИзделияСпецификации.Характеристика = ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка)
	|				ИЛИ &Характеристика = ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка))
	|		И (&НачалоПроизводства = ДАТАВРЕМЯ(1, 1, 1)
	|				ИЛИ (ВыходныеИзделияСпецификации.Ссылка.НачалоДействия = ДАТАВРЕМЯ(1, 1, 1)
	|					ИЛИ ВыходныеИзделияСпецификации.Ссылка.НачалоДействия <= &НачалоПроизводства)
	|					И (ВыходныеИзделияСпецификации.Ссылка.КонецДействия = ДАТАВРЕМЯ(1, 1, 1)
	|						ИЛИ ВыходныеИзделияСпецификации.Ссылка.КонецДействия > &НачалоПроизводства))
	|		И (ВыходныеИзделияСпецификации.НомерСтроки = 1
	|				ИЛИ НЕ &СпецификацииГдеИзделиеЯвляетсяОсновным)
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ РАЗЛИЧНЫЕ
	|		РесурсныеСпецификацииВозвратныеОтходы.Ссылка
	|	ИЗ
	|		Справочник.РесурсныеСпецификации.ВозвратныеОтходы КАК РесурсныеСпецификацииВозвратныеОтходы
	|	ГДЕ
	|		НЕ РесурсныеСпецификацииВозвратныеОтходы.Ссылка.ПометкаУдаления
	|		И (РесурсныеСпецификацииВозвратныеОтходы.Ссылка.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыСпецификаций.Действует)
	|				ИЛИ &ВсеСпецификации)
	|		И РесурсныеСпецификацииВозвратныеОтходы.Номенклатура = &Номенклатура
	|		И (РесурсныеСпецификацииВозвратныеОтходы.Характеристика = &Характеристика
	|				ИЛИ РесурсныеСпецификацииВозвратныеОтходы.Характеристика = ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка)
	|				ИЛИ &Характеристика = ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка))
	|		И (&НачалоПроизводства = ДАТАВРЕМЯ(1, 1, 1)
	|				ИЛИ (РесурсныеСпецификацииВозвратныеОтходы.Ссылка.НачалоДействия = ДАТАВРЕМЯ(1, 1, 1)
	|					ИЛИ РесурсныеСпецификацииВозвратныеОтходы.Ссылка.НачалоДействия <= &НачалоПроизводства)
	|					И (РесурсныеСпецификацииВозвратныеОтходы.Ссылка.КонецДействия = ДАТАВРЕМЯ(1, 1, 1)
	|						ИЛИ РесурсныеСпецификацииВозвратныеОтходы.Ссылка.КонецДействия > &НачалоПроизводства))
	|		И &ПоказыватьСпецификацииПоФиксированнойСтоимости) КАК Т";

	Если ИсключитьСпецификацииСЭтапамиПроизводстваНаСтороне Тогда
		
		Запрос.Текст = Запрос.Текст + "
			|	ГДЕ НЕ 1 В (
			|					ВЫБРАТЬ ПЕРВЫЕ 1 1
			|					ИЗ
			|						Справочник.ЭтапыПроизводства КАК ЭтапыПроизводства
			|					ГДЕ
			|						ЭтапыПроизводства.Владелец = Т.Ссылка
			|						И ЭтапыПроизводства.ПроизводствоНаСтороне
			|						И НЕ ЭтапыПроизводства.ПометкаУдаления
			|				)";
		
	КонецЕсли;
	
	Запрос.УстановитьПараметр("Номенклатура",       Номенклатура);
	Запрос.УстановитьПараметр("Характеристика",     Характеристика);
	Запрос.УстановитьПараметр("НачалоПроизводства", НачалоПроизводства);
	Запрос.УстановитьПараметр("ВсеСпецификации",    ВсеСпецификации);
	Запрос.УстановитьПараметр("ПоказыватьСпецификацииПоФиксированнойСтоимости",     ПоказыватьСпецификацииПоФиксированнойСтоимости);
	Запрос.УстановитьПараметр("СпецификацииГдеИзделиеЯвляетсяОсновным",             СпецификацииГдеИзделиеЯвляетсяОсновным);
	
	СписокСпецификаций.ЗагрузитьЗначения(Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка"));
	ИсключитьИзВыбораСпецификацию(СписокСпецификаций);
	
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(Список, "СписокСпецификаций", СписокСпецификаций.ВыгрузитьЗначения());
		
	УстановитьСпецификацияПоУмолчанию();
	
	ЗаполнитьИнформациюПоПараметрамВыбораСпецификации();
	
КонецПроцедуры

&НаСервере
Процедура СписокСпецификацийДляТаблицыПродукции()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ТаблицаИзделий.Номенклатура,
	|	ТаблицаИзделий.Характеристика,
	|	ТаблицаИзделий.Подразделение,
	|	ТаблицаИзделий.НачалоПроизводства
	|ПОМЕСТИТЬ ВТИзделия
	|ИЗ
	|	&ТаблицаИзделий КАК ТаблицаИзделий
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТИзделия.Номенклатура,
	|	ВТИзделия.Характеристика,
	|	ВТИзделия.Подразделение,
	|	ВыходныеИзделия.Ссылка КАК Спецификация
	|ПОМЕСТИТЬ ВТСпецификацииИзделий
	|ИЗ
	|	ВТИзделия КАК ВТИзделия
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.РесурсныеСпецификации.ВыходныеИзделия КАК ВыходныеИзделия
	|		ПО (ВыходныеИзделия.Номенклатура = ВТИзделия.Номенклатура)
	|			И (ВыходныеИзделия.Этап.Подразделение = ВТИзделия.Подразделение)
	|			И (ВыходныеИзделия.Характеристика = ВТИзделия.Характеристика
	|				ИЛИ ВыходныеИзделия.Характеристика = ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка))
	|			И (ВыходныеИзделия.Ссылка.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыСпецификаций.Действует))
	|				И (ВыходныеИзделия.Ссылка.НачалоДействия = ДАТАВРЕМЯ(1, 1, 1)
	|					ИЛИ НачалоПериода(ВыходныеИзделия.Ссылка.НачалоДействия, Месяц) <= ВТИзделия.НачалоПроизводства)
	|				И (ВыходныеИзделия.Ссылка.КонецДействия = ДАТАВРЕМЯ(1, 1, 1)
	|					ИЛИ ВыходныеИзделия.Ссылка.КонецДействия > ВТИзделия.НачалоПроизводства)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВТИзделия.Номенклатура,
	|	ВТИзделия.Характеристика,
	|	ВТИзделия.Подразделение,
	|	ВозвратныеОтходы.Ссылка
	|ИЗ
	|	ВТИзделия КАК ВТИзделия
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.РесурсныеСпецификации.ВозвратныеОтходы КАК ВозвратныеОтходы
	|		ПО (ВозвратныеОтходы.Номенклатура = ВТИзделия.Номенклатура)
	|			И (ВозвратныеОтходы.Характеристика = ВТИзделия.Характеристика
	|				ИЛИ ВозвратныеОтходы.Характеристика = ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка))
	|			И (ВозвратныеОтходы.Этап.Подразделение = ВТИзделия.Подразделение)
	|			И (ВозвратныеОтходы.Ссылка.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыСпецификаций.Действует))
	|				И (ВозвратныеОтходы.Ссылка.НачалоДействия = ДАТАВРЕМЯ(1, 1, 1)
	|					ИЛИ НачалоПериода(ВозвратныеОтходы.Ссылка.НачалоДействия, Месяц) <= ВТИзделия.НачалоПроизводства)
	|				И (ВозвратныеОтходы.Ссылка.КонецДействия = ДАТАВРЕМЯ(1, 1, 1)
	|					ИЛИ ВозвратныеОтходы.Ссылка.КонецДействия > ВТИзделия.НачалоПроизводства)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВТСпецификации.Спецификация
	|ПОМЕСТИТЬ ВТСпецификации
	|ИЗ
	|	ВТСпецификацииИзделий КАК ВТСпецификации
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТИзделия.Номенклатура,
	|	ВТИзделия.Характеристика,
	|	ВТИзделия.Подразделение,
	|	ВТСпецификации.Спецификация
	|ПОМЕСТИТЬ ВТКомбинации
	|ИЗ
	|	ВТИзделия КАК ВТИзделия,
	|	ВТСпецификации КАК ВТСпецификации
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТКомбинации.Спецификация
	|ПОМЕСТИТЬ ВтИсключения
	|ИЗ
	|	ВТКомбинации КАК ВТКомбинации
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТСпецификацииИзделий КАК ВТСпецификацииИзделий
	|		ПО ВТКомбинации.Номенклатура = ВТСпецификацииИзделий.Номенклатура
	|			И ВТКомбинации.Характеристика = ВТСпецификацииИзделий.Характеристика
	|			И ВТКомбинации.Подразделение = ВТСпецификацииИзделий.Подразделение
	|			И ВТКомбинации.Спецификация = ВТСпецификацииИзделий.Спецификация
	|ГДЕ
	|	ВТСпецификацииИзделий.Спецификация ЕСТЬ NULL 
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТСпецификации.Спецификация
	|ИЗ
	|	ВТСпецификации КАК ВТСпецификации
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВтИсключения КАК ВтИсключения
	|		ПО (ВтИсключения.Спецификация = ВТСпецификации.Спецификация)
	|ГДЕ
	|	ВтИсключения.Спецификация ЕСТЬ NULL ";
	
	Запрос.УстановитьПараметр("ТаблицаИзделий", ТаблицаПродукции.Выгрузить());
	
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	СписокСпецификаций = Новый СписокЗначений;
	
	Пока Выборка.Следующий() Цикл
		СписокСпецификаций.Добавить(Выборка.Спецификация);
	КонецЦикла;
	
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(Список, "СписокСпецификаций", СписокСпецификаций.ВыгрузитьЗначения());
	
КонецПроцедуры

&НаСервере
Процедура СписокСпецификацийИзделий(СписокИзделий)

	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СписокИзделий.Номенклатура КАК Номенклатура,
	|	СписокИзделий.Характеристика КАК Характеристика
	|ПОМЕСТИТЬ СписокИзделий
	|ИЗ
	|	&СписокИзделий КАК СписокИзделий
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Номенклатура,
	|	Характеристика
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	Т.Ссылка
	|ИЗ
	|	(ВЫБРАТЬ РАЗЛИЧНЫЕ
	|		ВыходныеИзделияСпецификации.Ссылка КАК Ссылка
	|	ИЗ
	|		СписокИзделий КАК СписокИзделий
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.РесурсныеСпецификации.ВыходныеИзделия КАК ВыходныеИзделияСпецификации
	|			ПО (ВыходныеИзделияСпецификации.Номенклатура = СписокИзделий.Номенклатура)
	|				И (ВыходныеИзделияСпецификации.Характеристика = СписокИзделий.Характеристика
	|					ИЛИ ВыходныеИзделияСпецификации.Характеристика = ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка)
	|					ИЛИ СписокИзделий.Характеристика = ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка))
	|				И (НЕ ВыходныеИзделияСпецификации.Ссылка.ПометкаУдаления)
	|				И (ВыходныеИзделияСпецификации.Ссылка.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыСпецификаций.Действует))
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ РАЗЛИЧНЫЕ
	|		РесурсныеСпецификацииВозвратныеОтходы.Ссылка
	|	ИЗ
	|		СписокИзделий КАК СписокИзделий
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.РесурсныеСпецификации.ВозвратныеОтходы КАК РесурсныеСпецификацииВозвратныеОтходы
	|			ПО (РесурсныеСпецификацииВозвратныеОтходы.Номенклатура = СписокИзделий.Номенклатура)
	|				И (РесурсныеСпецификацииВозвратныеОтходы.Характеристика = СписокИзделий.Характеристика
	|					ИЛИ РесурсныеСпецификацииВозвратныеОтходы.Характеристика = ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка)
	|					ИЛИ СписокИзделий.Характеристика = ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка))
	|				И (НЕ РесурсныеСпецификацииВозвратныеОтходы.Ссылка.ПометкаУдаления)
	|				И (РесурсныеСпецификацииВозвратныеОтходы.Ссылка.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыСпецификаций.Действует))
	|	ГДЕ
	|		&ПоказыватьСпецификацииПоФиксированнойСтоимости) КАК Т";
	
	Если ИсключитьСпецификацииСЭтапамиПроизводстваНаСтороне Тогда
		
		Запрос.Текст = Запрос.Текст + "
			|	ГДЕ НЕ 1 В (
			|					ВЫБРАТЬ ПЕРВЫЕ 1 1
			|					ИЗ
			|						Справочник.ЭтапыПроизводства КАК ЭтапыПроизводства
			|					ГДЕ
			|						ЭтапыПроизводства.Владелец = Т.Ссылка
			|						И ЭтапыПроизводства.ПроизводствоНаСтороне
			|						И НЕ ЭтапыПроизводства.ПометкаУдаления
			|				)";
		
	КонецЕсли;
	
	ТаблицаСписокИзделий = Новый ТаблицаЗначений;
	ТаблицаСписокИзделий.Колонки.Добавить("Номенклатура",   Новый ОписаниеТипов("СправочникСсылка.Номенклатура"));
	ТаблицаСписокИзделий.Колонки.Добавить("Характеристика", Новый ОписаниеТипов("СправочникСсылка.ХарактеристикиНоменклатуры"));
	ТаблицаСписокИзделий.Колонки.Добавить("Подразделение",  Новый ОписаниеТипов("СправочникСсылка.СтруктураПредприятия"));
	
	Для каждого СтруктураДанных Из СписокИзделий Цикл
		ЗаполнитьЗначенияСвойств(ТаблицаСписокИзделий.Добавить(), СтруктураДанных);
	КонецЦикла; 
	
	Запрос.УстановитьПараметр("СписокИзделий", ТаблицаСписокИзделий);
	Запрос.УстановитьПараметр("ПоказыватьСпецификацииПоФиксированнойСтоимости", ПоказыватьСпецификацииПоФиксированнойСтоимости);
	Запрос.УстановитьПараметр("ИсключитьСпецификацииСЭтапамиПроизводстваНаСтороне", ИсключитьСпецификацииСЭтапамиПроизводстваНаСтороне);
	
	СписокСпецификаций.ЗагрузитьЗначения(Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка"));

	ИсключитьИзВыбораСпецификацию(СписокСпецификаций);
	
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(Список, "СписокСпецификаций", СписокСпецификаций.ВыгрузитьЗначения());
	
	ТаблицаСписокИзделий.Свернуть("Номенклатура,Характеристика,Подразделение");
	Если ТаблицаСписокИзделий.Количество() = 1 Тогда
		
		ДанныеНоменклатуры = ТаблицаСписокИзделий[0];
		
		Номенклатура   = ДанныеНоменклатуры.Номенклатура;
		Характеристика = ДанныеНоменклатуры.Характеристика;
		Подразделение  = ДанныеНоменклатуры.Подразделение;
		
		УстановитьСпецификацияПоУмолчанию();
		
		ЗаполнитьИнформациюПоПараметрамВыбораСпецификации();
		
	Иначе
		
		Элементы.ФормаВыбратьИНазначитьОсновной.Видимость = Ложь;
		Элементы.ПараметрыВыбора.Видимость = Ложь;
		Элементы.Список.ПоложениеКоманднойПанели = ПоложениеКоманднойПанелиЭлементаФормы.Нет;
		
		СпецификацияПоУмолчанию = Справочники.РесурсныеСпецификации.ПустаяСсылка();
	
		ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(
					Список, 
					"СпецификацияПоУмолчанию", 
					СпецификацияПоУмолчанию);
				
	КонецЕсли; 
	
КонецПроцедуры

&НаСервере
Процедура ИсключитьИзВыбораСпецификацию(СписокСпецификаций)

	Если НЕ ИсключитьИзВыбораСпецификацию.Пустая() Тогда
		НайденныйИндекс = СписокСпецификаций.НайтиПоЗначению(ИсключитьИзВыбораСпецификацию);
		Если НайденныйИндекс <> Неопределено Тогда
			СписокСпецификаций.Удалить(НайденныйИндекс);
		КонецЕсли; 
	КонецЕсли; 

КонецПроцедуры

&НаСервере
Процедура ЗаполнитьИнформациюПоПараметрамВыбораСпецификации()
	
	Если ТаблицаПродукции.Количество() > 0 Тогда
		
		МассивИзделий = Новый Массив;
		Для Каждого Строка Из ТаблицаПродукции Цикл
			Если МассивИзделий.Найти(Строка.Номенклатура) = Неопределено Тогда
				МассивИзделий.Добавить(Строка.Номенклатура);
			КонецЕсли;
		КонецЦикла;
		
		ПараметрыВыбора = НСтр("ru='Изделия: ';uk='Вироби: '");
		
		Для Индекс = 0 По МассивИзделий.Количество()-1 Цикл
			
			Если Индекс = МассивИзделий.Количество() - 1 Тогда
				ПараметрыВыбора = ПараметрыВыбора + "%" + Строка(Индекс + 1) + ".";
			Иначе
				ПараметрыВыбора = ПараметрыВыбора + "%" + Строка(Индекс + 1) + ", ";
			КонецЕсли;
			
		КонецЦикла;
		
		ПараметрыВыбора = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтрокуИзМассива(ПараметрыВыбора, МассивИзделий);
		
	Иначе
		
		ПараметрыВыбора = НСтр("ru='Подразделение:';uk='Підрозділ:'");
		
		Если НЕ ЗначениеЗаполнено(Подразделение) Тогда
			ПараметрыВыбора = ПараметрыВыбора + " " + НСтр("ru='<не выбрано>';uk='<не вибрано>'");
		Иначе
			ПараметрыВыбора = ПараметрыВыбора + " """ + Строка(Подразделение) + """";
		КонецЕсли;
		
		ПараметрыВыбора = ПараметрыВыбора + НСтр("ru='; Номенклатура:';uk='; Номенклатура:'");
		
		Если НЕ ЗначениеЗаполнено(Номенклатура) Тогда
			ПараметрыВыбора = ПараметрыВыбора + " " + НСтр("ru='<не выбрана>';uk='<не вказано>'");
		Иначе
			ПараметрыВыбора = ПараметрыВыбора + " """ + Строка(Номенклатура) + ?(Характеристика.Пустая(), "", ", " + Строка(Характеристика)) + """";
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура НастроитьФормуПоТаблицеПродукции()
	
	Таблица = ПолучитьИзВременногоХранилища(Параметры.АдресТаблицыПродукции).Скопировать();
	Таблица.Свернуть("Номенклатура, Характеристика, Подразделение, НачалоПроизводства");
	ТаблицаПродукции.Загрузить(Таблица);
	
	СписокСпецификацийДляТаблицыПродукции();
	
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(Список, "СпецификацияПоУмолчанию", Неопределено);
	
	ЗаполнитьИнформациюПоПараметрамВыбораСпецификации();
	
	УстановитьСпецификацияПоУмолчанию();
	
	Заголовок = НСтр("ru='Заполнение / замена спецификации в выпусках';uk='Заповнення / заміна специфікації у випусках'");
	Элементы.ФормаВыбрать.Заголовок = НСтр("ru='Заменить';uk='Замінити'");
	Элементы.ФормаВыбратьИНазначитьОсновной.Заголовок = НСтр("ru='Заменить и назначить основной';uk='Замінити і призначити основною'");
	Элементы.ФормаИзменитьПрименениеСпецификации.Видимость = Ложь;
	
КонецПроцедуры

&НаСервере
Функция ОсновнаяСпецификацияПоТаблицеПродукции()
	
	ПараметрыЗапроса = Новый Структура("ДляСпискаНоменклатуры");
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ТаблицаИзделий.Номенклатура,
	|	ТаблицаИзделий.Характеристика,
	|	ТаблицаИзделий.Подразделение,
	|	ТаблицаИзделий.НачалоПроизводства
	|ПОМЕСТИТЬ СписокНоменклатуры
	|ИЗ
	|	&ТаблицаИзделий КАК ТаблицаИзделий
	|;
	|" + УправлениеДаннымиОбИзделиях.ПолучитьТекстЗапросаОсновнойСпецификации(ПараметрыЗапроса);
	
	Запрос.УстановитьПараметр("ТаблицаИзделий", ТаблицаПродукции.Выгрузить());
	
	ТаблицаОсновныхСпецификаций = Запрос.Выполнить().Выгрузить();
	
	СтруктураОтбора = Новый Структура("Номенклатура, Характеристика, Подразделение, Спецификация");
	
	СпецификацияПоУмолчанию = Неопределено;
	
	Для Каждого Строка Из СписокСпецификаций Цикл
		
		ЭтоОсновнаяСпецификация = Истина;
		СтруктураОтбора.Спецификация = Строка.Значение;
		
		Для Каждого СтрокаПродукции Из ТаблицаПродукции Цикл
			
			ЗаполнитьЗначенияСвойств(СтруктураОтбора, СтрокаПродукции);
			
			Если ТаблицаОсновныхСпецификаций.НайтиСтроки(СтруктураОтбора).Количество() = 0 Тогда
				ЭтоОсновнаяСпецификация = Ложь;
				Прервать;
			КонецЕсли;
			
		КонецЦикла;
		
		Если ЭтоОсновнаяСпецификация Тогда
			СпецификацияПоУмолчанию = Строка.Значение;
		КонецЕсли;
		
		Прервать;
		
	КонецЦикла;
	
	Возврат СпецификацияПоУмолчанию;
	
КонецФункции


#КонецОбласти

#КонецОбласти
